/* 
  String_ui.strings
  RRPlayer

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/

// Common
"general.on" = "On";
"general.off" = "Off";
"general.login" = "Login";
"general.logout" = "Logout";
"general.ok" = "OK";
"general.cancel" = "Cancel";
"general.username" = "Username";
"general.password" = "Password";

// PlaylistViewController.swift
"playlist.playlist_cap" = "PLAYLIST";
"playlist.chapter_cap" = "CHAPTERS";

// MainWindowController.swift
"main.buffering_indicator" = "Buffering... %d%%";

// QuickSettingViewController.swift
"quicksetting.item_default" = "Default";
"quicksetting.item_none" = "None";

// OSDMessage.swift
"osd.pause" = "Pause";
"osd.resume" = "Resume";
"osd.volume" = "Volume: %i";
"osd.speed" = "Speed: %.2fx";
"osd.aspect" = "Aspect Ratio: %@";
"osd.crop" = "Crop: %@";
"osd.rotate" = "Rotate: %i°";
"osd.deinterlace" = "Deinterlace: %@";
"osd.audio_delay.nodelay" = "Audio Delay: No Delay";
"osd.audio_delay.later" = "Audio Delay: %.2fs Later";
"osd.audio_delay.earlier" = "Audio Delay: %.2fs Earlier";
"osd.sub_delay.nodelay" = "Subtitle Delay: No Delay";
"osd.sub_delay.later" = "Subtitle Delay: %.2fs Later";
"osd.sub_delay.earlier" = "Subtitle Delay: %.2fs Earlier";
"osd.subtitle_pos" = "Subtitle Position: %.1f";
"osd.mute" = "Mute";
"osd.unmute" = "Unmute";
"osd.screenshot" = "Screenshot Captured";
"osd.abloop.a" = "AB-Loop: A";
"osd.abloop.b" = "AB-Loop: B";
"osd.abloop.clear" = "AB-Loop: Cleared";
"osd.stop" = "Stop";
"osd.chapter" = "Chapter: %@";
"osd.subtitle_scale" = "Subtitle Scale: %.2fx";
"osd.add_to_playlist" = "Added %i Files to Playlist";
"osd.clear_playlist" = "Cleared Playlist";
"osd.video_eq.contrast" = "Contrast: %i";
"osd.video_eq.gamma" = "Gamma: %i";
"osd.video_eq.hue" = "Hue: %i";
"osd.video_eq.saturation" = "Saturation: %i";
"osd.video_eq.brightness" = "Brightness: %i";
"osd.find_online_sub" = "Finding online subtitles...";
"osd.sub_not_found" = "No subtitle found";
"osd.sub_found" = "%d subtitle(s) found. Downloading...";
"osd.sub_downloaded" = "Subtitle downloaded";
"osd.sub_saved" = "Subtitle saved";
"osd.network_error" = "Network error";
"osd.file_error" = "Error reading file";
"osd.cannot_login" = "Cannot login";
"osd.canceled" = "Canceled";
"osd.filter_added" = "Added Filter: %@";
"osd.filter_removed" = "Removed Filter";

"preference.title" = "Preferences";
"preference.general" = "General";
"preference.ui" = "UI";
"preference.codec" = "Codec";
"preference.subtitle" = "Subtitle";
"preference.network" = "Network";
"preference.control" = "Control";
"preference.keybindings" = "Key Bindings";
"preference.advanced" = "Advanced";
"preference.scripts" = "Scripts";
"preference.not_logged_in" = "Not logged in";
"preference.logged_in_as" = "Logged in as %@";
"preference.system_media_control" = "Use system media control";

"menu.volume"= "Volume: %d";
"menu.audio_delay" = "Audio Delay: %.2fs";
"menu.sub_delay" = "Subtitie Delay: %.2fs";
"menu.fullscreen" = "Enter Full Screen";
"menu.exit_fullscreen" = "Exit Full Screen";
"menu.pip" = "Enter Picture-in-Picture";
"menu.exit_pip" = "Exit Picture-in-Picture";
"menu.pause" = "Pause";
"menu.resume" = "Resume";
"menu.speed" = "Speed: %.2fx";

"menu.seek_forward" = "Step Forward %.0fs";
"menu.seek_backward" = "Step Backward %.0fs";
"menu.speed_up" = "Speed Up to %.1fx";
"menu.speed_down" = "Speed Down to %.1fx";
"menu.volume_up" = "Volume + %.0f%%";
"menu.volume_down" = "Volume - %.0f%%";
"menu.audio_delay_up" = "Audio Delay + %.1fs";
"menu.audio_delay_down" = "Audio Delay - %.1fs";
"menu.sub_delay_up" = "Subtitle Delay + %.1fs";
"menu.sub_delay_down" = "Subtitle Delay - %.1fs";

"track.none" = "<None>";

// Alerts
"alert.title_error" = "Error";
"alert.title_warning" = "Warning";
"alert.title_info" = "Information";

"alert.fatal_error" = "Fatal error: %@ \nThe application will exit now.";
"alert.mpv_error" = "Internal error %@ (%@) when setting option %@.";
"alert.sleep" = "Cannot prevent display sleep!";

"alert.unsupported_audio" = "Unsupported external audio file.";
"alert.unsupported_sub" = "Unsupported external subtitle.";
"alert.unsupported_url" = "Unsupported URL.";
"alert.wrong_url_format" = "Wrong URL format.";

"alert.error_open" = "Cannot open file or stream!";
"alert.error_finding_file" = "Cannot find %@ file!";
"alert.error_loading_script" = "Cannot load script %@!";
"alert.error_saving_file" = "Error occured when saving %@: %@";
"alert.error_deleting_file" = "Cannot delete the file.";

"alert.config.new.title" = "New Input Configuration";
"alert.config.new.message" = "Please enter a name for the new configuration.";
"alert.config.duplicate.title" = "Duplicate Configuration";
"alert.config.duplicate.message" = "Please enter name for the duplicated configuration file.";
"alert.config.empty_name" = "The name cannot be empty.";
"alert.config.name_existing" = "The name already exists.";
"alert.config.file_existing.title" = "File Already Exists";
"alert.config.file_existing.message" = "It should not happen. Choose OK to overwrite, Cancel to reveal the file in finder.";
"alert.config.cannot_create" = "Cannot create config file!";
"alert.config.cannot_write" = "Cannot write to config file!";

"alert.filter.incorrect" = "Error occured when setting filters. Please check your parameter format.";
"alert.add_filter.title" = "New Filter";
"alert.add_filter.message" = "Please enter a filter string in format of MPV's vf or af command.";

"alert.keybinding_config.error" = "Error parsing keybinding configuration file \"%@\"! Fallback to RRPlayer Default keybinding setting. Please check your configuration.";

"alert.extra_option.cannot_read" = "Cannot read user defined extra mpv options.";
"alert.extra_option.empty" = "Key or value cannot be empty!";
"alert.extra_option.error" = "Error setting option --%@=%@ with return value %d. Please check your extra option settings in Preference > Advanced.";
"alert.extra_option.config_folder" = "Error setting config directory \"%@\".";

"alert.playlist.error_deleting" = "Error deleting: %@";

"alert.sub.no_selected" = "Please select a downloaded subtitle first.";
"alert.sub_lang_not_set" = "Please set preferred subtitle language in preferences before using opensubtitles. English(eng) will be used this time.";
"alert.sub.cannot_save_passwd" = "Cannot save your password to Keychain: %@";
"alert.sub.cannot_login" = "Cannot login. Please check your username, password and network status.\n\n%@";

"alert.set_default.title" = "Setting RRPlayer as Default App";
"alert.set_default.message" = "RRPlayer will be set as the default app for all file types it supports.";
"alert.set_default.success" = "Finished with %d success and %d failed.";

"alert.add_watch.title" = "Add Watch Property";
"alert.add_watch.message" = "Please enter a valid MPV property name.";

"alert.jump_to.title" = "Jump to";
"alert.jump_to.message" = "Please enter the time you want to jump to. Example: 20:35";

"alert.opensub.login.title" = "OpenSubtitles Login";
"alert.opensub.login.message" = "Please enter your username and password";

"alert.open_url.title" = "Open URL";
"alert.open_url.message" = "Please enter the URL:";
"alert.choose_media_file.title" = "Choose Media File";

"alert.delete_history.title" = "Delete Playback History";
"alert.delete_history.message" = "Are you sure to delete select entries?";

"alert.filter_hwdec.message" = "You are about to apply a video fliter. However, your current hardware decoder may not support video filters well. You can either disable hardware decoding or switch to Auto(Copy), which will consume twice the memory.\nYou may need to repeat previous operation (like, setting the crop) to get it working.";
"alert.filter_hwdec.abort" = "Abort";
"alert.filter_hwdec.turn_off" = "Turn off hardware decoding";
"alert.filter_hwdec.use_copy" = "Switch to Auto(Copy)";

"alert.clear_cache.title" = "Clear Thumbnail Cache";
"alert.clear_cache.message" = "Are you sure to clear all thumbnail Cache?";
"alert.clear_cache.success" = "Cache cleared.";

"alert.nothing_to_open" = "Nothing to open.";

"alert.no_video_track" = "There is no video track.";

"alert.duplicate_config" = "You cannot edit default configurations directly. Please duplicate it before editing.";

"pl_menu.title_multi" = "%d Items";
"pl_menu.play_next" = "Play Next";
"pl_menu.play_in_new_window" = "Play in New Window";
"pl_menu.remove" = "Remove";
"pl_menu.remove_multi" = "Remove Selected";
"pl_menu.delete" = "Move to Trash";
"pl_menu.delete_multi" = "Move Selected Files to Trash";
"pl_menu.delete_after_play" = "Move to Trash After Playback";
"pl_menu.delete_after_play_multi" = "Move Selected Files to Trash After Playback";
"pl_menu.reveal_in_finder" = "Reveal in Finder";
"pl_menu.add_item" = "Add Item…";
"pl_menu.clear_playlist" = "Clear Playlist";
"pl_menu.matched_sub" = "Matched %d Subtitle(s)";
"pl_menu.add_sub" = "Add Subtitle…";
"pl_menu.wrong_sub" = "Wrong Subtitle!";

"keymapping.title" = "Key Mapping";
"keymapping.message" = "Press any key to record.";

"filter.video_filters" = "Video Filters";
"filter.audio_filters" = "Audio Filters";

"hwdec.no" = "Disable Hardware decoding.";
"hwdec.auto" = "Enable hardware decoding. However, most video filters won't work properly.";
"hwdec.auto-copy" = "Enable hardware decoding. It will consume double the memory but works with video filters.";

"subencoding.auto" = "Auto detect";

// Touch bar

"touchbar.ahead_15" = "15sec Ahead";
"touchbar.ahead_30" = "30sec Ahead";
"touchbar.back_15" = "15sec Back";
"touchbar.back_30" = "30sec Back";
"touchbar.next_video" = "Next Video";
"touchbar.prev_video" = "Previous Video";
"touchbar.increase_volume" = "Volume +";
"touchbar.decrease_volume" = "Volume -";
"touchbar.rewind" = "Rewind";
"touchbar.fast_forward" = "Fast Forward";
"touchbar.play_pause" = "Play / Pause";
"touchbar.seek" = "Seek";
"touchbar.time" = "Time Position";

//恢复设置
"alert.restoreDefaults.title" ="resotre";
"alert.restoreDefaults.message" ="Are you sure you want to restore all settings?";
